latex/SheavesInGeometryAndLogic/SheavesInGeometryAndLogic.tex
% Created 2020-04-11 六 22:56
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{imakeidx}
\usepackage{hyperref}
\usepackage{minted}
\input{preamble.tex}
\author{Sanders Mac Lane \& Leke Moerdijk}
\date{\today}
\title{\aunclfamily\Huge Sheaves in Geometry and Logic}
\hypersetup{
 pdfauthor={Sanders Mac Lane \& Leke Moerdijk},
 pdftitle={\aunclfamily\Huge Sheaves in Geometry and Logic},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3.6)}, 
 pdflang={English}}
\begin{document}

\maketitle \clearpage
\tableofcontents \clearpage
\section{Categorical Preliminaries}
\label{sec:orgcea7c41}
A \textbf{category} \(\bC\) consists of a collection of \textbf{objects}, a collection of
\textbf{morphisms} and four operations; two of these operations associate with each
morphism \(f\) of \(\bC\) its \textbf{domain} \(\dom(f)\) or \(\textd_0(f)\) and its
\textbf{codomain} \(\cod(f)\) or \(\textd_1(f)\), respectively, both of which are objects of
\(\bC\). The other two operations are operation which associates with each
object \(C\) of \(\bC\) a morphism \(1_C\) (or \(\id_C\)) of \(\bC\) called the
\textbf{identity morphism} of \(C\) and an operation of \(\bC\) s.t.
\(\textd_0(f)=\textd_1(g)\) another morphism \(f\circ g\). These operations
are required to satisfy the following axioms
\begin{enumerate}
\item \(\textd_0(1_C)=C=\textd_1(1_C)\)
\item \(\td_0(f\circ g)=\td_0(g),\td_1(f\circ g)=\td_1(f)\)
\item \(1_D\circ f=f,f\circ 1_C=f\)
\item \((f\circ g)\circ h=f\circ(g\circ h)\)
\end{enumerate}


In an arbitrary category \(\bC\), a morphism \(f:C\to D\) in \(\bC\) is called
an \textbf{isomorphism} if there exists a morphism \(g:D\to C\) s.t. \(f\circ g=1_D\)
and \(g\circ f=1_C\). If such a morphism \(f\) exists, one says that \(C\) is
isomorphic to \(D\) and one writes \(f:C\xrightarrow{\sim}D\) and \(C\cong D\)

A morphism \(f:C\to D\) is called an \textbf{epi(morphism)} if for any object \(E\) and
any two parallel morphisms \(g,h:D\rightrightarrows E\) in \(\bC\), \(gf=hf\)
implies \(g=h\); one writes \(f:C\twoheadrightarrow D\) to indicate that \(f\)
is an epimorphism. Dually, \(f:C\to D\) is called a \textbf{mono(morphism)} if for any
object \(B\) and any two parallel morphisms \(g,h:B\rrarrow C\) in \(\bC\),
(fg=fh) implies \(g=h\); in this case, one writes \(f:C\monoarrow D\). Two
monomorphisms \(f:A\monoarrow D\) and \(g:B\monoarrow D\) with a common
codomain \(D\) are called \textbf{equivalent} if there exists an isomorphism
\(h:A\xrightarrow{\sim}B\) with \(gh=f\). A \textbf{subobject} of \(D\) is an equivalence
class of monomorphisms into \(D\). The collection \(\Sub_{\bC}(D)\) of
subobjects of \(D\) carries a natural partial order defined by \([f]\le[g]\) iff
there is an \(h:A\to B\) s.t. \(f=gh\), where \([f]\) and \([g]\) are the
classes of \(f:A\monoarrow D\) and \(g:B\monoarrow D\)

\begin{center}
\begin{tikzcd}
A \arrow[r,rightarrowtail,"f"] \arrow[d,"h"] & D\\
B \arrow[ur,rightarrowtail,"g"']
\end{tikzcd}
\end{center}

If \(\bC\) is a category, we sometimes write \(\bC_0\) for its collection of
objects and \(\bC_1\) for its collection of mophisms. For two objects \(C\) and
\(D\), the collection of morphisms with domain \(C\) and codomain \(D\) is denoted
by one of the following three symbols

\begin{equation*}
\Hom_{\bC}(C,D),\quad\Hom(C,D),\quad\bC(C,D)
\end{equation*}
\end{document}